
&НаКлиенте
Процедура ПоказатьДиаграмму(Команда)

    АдресДанных = ПоместитьДанныеВоХранилищеНаСервере();
    
    ПараметрыФормы = Новый Структура("АдресДанных, ТекущийГод", АдресДанных, Объект.Дата);
    
    ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтаФорма);
    
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВоХранилищеНаСервере()
    ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить(); 
    Возврат ПоместитьВоВременноеХранилище(ТаблицаОтпусков, УникальныйИдентификатор);
КонецФункции




&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьДниСтроки(Элементы.ОтпускаСотрудников.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьДниСтроки(Элементы.ОтпускаСотрудников.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	РассчитатьДниСтроки(Элементы.ОтпускаСотрудников.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДниСтроки(СтрокаТЧ)
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончания) Тогда
		КоличествоДней = (КонецДня(СтрокаТЧ.ДатаОкончания) - НачалоДня(СтрокаТЧ.ДатаНачала) + 1) / 86400;
		СтрокаТЧ.Продолжительность = Макс(Цел(КоличествоДней), 0);
	Иначе
		СтрокаТЧ.Продолжительность = 0;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПересчитатьВсеСтрокиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПересчитатьВсеСтрокиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВсеСтрокиНаСервере()
	Для Каждого Стр Из Объект.ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(Стр.ДатаНачала) И ЗначениеЗаполнено(Стр.ДатаОкончания) Тогда
			Стр.Продолжительность = (КонецДня(Стр.ДатаОкончания) - НачалоДня(Стр.ДатаНачала) + 1) / 86400;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры