
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
	Если НЕ (РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ Проведен) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		
		Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда
			
			ТекстСообщения = СтрШаблон("У сотрудника %1 дата окончания отпуска (%2) не может быть меньше даты начала (%3)!", 
				Строка.Сотрудник, 
				Формат(Строка.ДатаОкончания, "ДФ=dd.MM.yyyy"), 
				Формат(Строка.ДатаНачала, "ДФ=dd.MM.yyyy"));
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "ОтпускаСотрудников[" + ОтпускаСотрудников.Индекс(Строка) + "].ДатаОкончания";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Год) И (Год(Строка.ДатаНачала) <> Год(Год)) Тогда
			
			ТекстСообщения = СтрШаблон("Отпуск сотрудника %1 назначен на %2 год, что не соответствует году документа (%3)!", 
				Строка.Сотрудник, 
				Год(Строка.ДатаНачала), 
				Год(Год));
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "ОтпускаСотрудников[" + ОтпускаСотрудников.Индекс(Строка) + "].ДатаНачала";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

