
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("АдресДанных") Тогда
        ДанныеТЗ = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
        ПостроитьДиаграмму(ДанныеТЗ, Параметры.ТекущийГод);
    КонецЕсли;
    	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграмму(ДанныеТЗ, Год)
	
    Объект.Год = Год; 
    
    ЧислоВыбранногоГода = Год(Объект.Год);
    
    ДиаграммаГанта.Обновление = Ложь;
    ДиаграммаГанта.Очистить(); 
    ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь; 
    
  	НачалоГрафика = Дата(ЧислоВыбранногоГода, 1, 1);
	КонецГрафика  = КонецДня(Дата(ЧислоВыбранногоГода, 12, 31));
	
	ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГрафика, КонецГрафика);
   
    
    Серия = ДиаграммаГанта.УстановитьСерию("Отпуска"); 
	
	Серия.Текст = Серия.Значение;
    
    Для Каждого Строка Из ДанныеТЗ Цикл
    	Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник); 
		Точка.Текст = Точка.Значение;
    
   		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
   		Интервал = Значение.Добавить();
   		Интервал.Начало = Строка.ДатаНачала; 
        Интервал.Конец = Строка.ДатаОкончания; 
   
    КонецЦикла;   
       
КонецПроцедуры