
//&НаКлиенте
//Процедура СоздатьАкты(Команда) 
//	
//	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите период!");
//		Возврат;
//	КонецЕсли;

//	ПараметрыПроцедуры = Новый Структура;
//	ПараметрыПроцедуры.Вставить("Период", Объект.Период);
//	
//	МассивДоговоров = Новый Массив;
//	Для Каждого СтрокаТЧ Из Объект.СписокДоговоров Цикл
//		МассивДоговоров.Добавить(СтрокаТЧ.Договор);
//	КонецЦикла;
//	ПараметрыПроцедуры.Вставить("Договоры", МассивДоговоров);
//	
//	
//	РезультатФон = ЗапуститьВыполнениеНаСервере(ПараметрыПроцедуры);
//	
//	
//	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
//	ПараметрыОжидания.ТекстСообщения = "Выполняется массовое создание и проведение актов...";
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗавершенияСоздания", ЭтаФорма);
//	
//	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФон, ОписаниеОповещения, ПараметрыОжидания);
//	
//КонецПроцедуры   

&НаКлиенте
Процедура СоздатьАкты(Команда) 
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите период!");
		Возврат;
	КонецЕсли;
	
	МассивДоговоров = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.СписокДоговоров Цикл
		МассивДоговоров.Добавить(СтрокаТЧ.Договор);
	КонецЦикла;
	
	Если МассивДоговоров.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Список договоров для обработки пуст.");
		Возврат;
	КонецЕсли;

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Период", Объект.Период);
	ПараметрыПроцедуры.Вставить("Договоры", МассивДоговоров);
	
	
	ТаблицаРезультатов = ВыполнитьСозданиеНаСервере(ПараметрыПроцедуры);
	
		Если ТаблицаРезультатов <> Неопределено Тогда
		Для Каждого РезультатСтр Из ТаблицаРезультатов Цикл
			ПараметрыПоиска = Новый Структура("Договор", РезультатСтр.Договор);
			НайденныеСтроки = Объект.СписокДоговоров.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого ТекСтрока Из НайденныеСтроки Цикл
				ТекСтрока.Реализация = РезультатСтр.Реализация;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя("Готово", , "Обработка договоров окончена.");

КонецПроцедуры

&НаСервере
Функция ВыполнитьСозданиеНаСервере(ПараметрыПроцедуры)
	
	Возврат Обработки.ВКМ_СозданиеАктов.ВыполнитьСозданиеРеализацийНаСервере(ПараметрыПроцедуры);

КонецФункции


&НаСервере
Функция ЗапуститьВыполнениеНаСервере(ПараметрыПроцедуры)
	
	
	
	ИмяПроцедуры = "Обработка.ВКМ_СозданиеАктов.ВыполнитьСозданиеРеализацийВФоне";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ЭтаФорма.УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Массовое создание актов (ВКМ)";
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗавершенияСоздания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ПоказатьОповещениеПользователя("Завершено", , "Обработка договоров окончена.");
	КонецЕсли;
	
КонецПроцедуры
