
Процедура ВКМ_ОтправитьСообщениеВТГ() Экспорт
	// Вставить содержимое обработчика.
	
	ВыборкаУведомлений = Справочники.ВКМ_УведомленияТелеграммБоту.Выбрать();
    
    Пока ВыборкаУведомлений.Следующий() Цикл
        
        Текст = ВыборкаУведомлений.ТекстСообщения;
	
	ОтправитьВТелеграмНаСервере(Текст);
	
	УспешноОтправлено = Ложь;
        Попытка
            // Пример имитации успешной отправки. 
            // В реальности здесь вызывается функция API-запроса.
            // Например: УспешноОтправлено = ОтправитьЧерезAPI(Текст);
            ЗаписьЖурналаРегистрации("УведомлениеТелеграм", УровеньЖурналаРегистрации.Информация, , , "Попытка отправки сообщения: " + Текст);
            УспешноОтправлено = Истина; 
        Исключение
            ЗаписьЖурналаРегистрации("УведомлениеТелеграм", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка отправки: " + ОписаниеОшибки());
            УспешноОтправлено = Ложь;
        КонецПопытки;
        
        Если УспешноОтправлено Тогда
            // Если отправлено успешно, помечаем элемент на удаление
            
            ОбъектУведомления = ВыборкаУведомлений.Ссылка.ПолучитьОбъект(); 
            
            Если ОбъектУведомления <> Неопределено Тогда
                ОбъектУведомления.Удалить(); // Вызываем метод Удалить() у объекта
                ЗаписьЖурналаРегистрации("УведомлениеТелеграм", УровеньЖурналаРегистрации.Информация, , , "Успешно отправлено и удалено.");
            КонецЕсли;
            
            
            
//            ВыборкаУведомлений.Ссылка.Удалить();
//            ЗаписьЖурналаРегистрации("УведомлениеТелеграм", УровеньЖурналаРегистрации.Информация, , , "Успешно отправлено и удалено.");
        КонецЕсли;
        
    КонецЦикла;
	
КонецПроцедуры



Функция ВКМ_ТокенУправленияТелеграмБотом()
    Возврат "8481755251:AAGvIIDmewyBy1Ok-mhpb5Hau3w2Xr6DPSI";
КонецФункции

// Получение идентификатора группы
Функция ВКМ_ИдентификаторГруппыДляОповещения()
    Возврат "6158330249";
КонецФункции



Процедура ОтправитьВТелеграмНаСервере(Текст)
	Параметры1 = Новый Структура("АдресТелегарм,token,IdGroup");
	Параметры1.АдресТелегарм = "api.telegram.org";  
	Параметры1.token = ВКМ_ТокенУправленияТелеграмБотом(); 							
	Параметры1.IdGroup = ВКМ_ИдентификаторГруппыДляОповещения();
	Сообщение = Текст;

	ОтправитьСообщениеВТелеграм(Параметры1,Сообщение);	
КонецПроцедуры


Процедура ОтправитьСообщениеВТелеграм(Параметры1,Сообщение) 
	
	Если ЗначениеЗаполнено(Сообщение) Тогда  
		СтрокаПараметров = "chat_id="+Параметры1.IdGroup+"&parse_mode=html&text="+Сообщение;       
		ВыполнитьHTTPЗапрос("POST",Параметры1.АдресТелегарм,"/bot"+Параметры1.token+"/sendMessage",СтрокаПараметров); 
	КонецЕсли;	
	
КонецПроцедуры

Функция ВыполнитьHTTPЗапрос(Метод,АдресСайта,АдресРесурса,СтрокаПараметров)     
	 
	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive");
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	HTTPЗапрос.Заголовки.Вставить(Метод + " /enter HTTP/1.1");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, "utf-8");
	HTTPЗапрос.АдресРесурса = АдресРесурса;
	
	
		Соединение1 = Новый HTTPСоединение(
		АдресСайта, 443, , , , 30, 
		Новый ЗащищенноеСоединениеOpenSSL()
		);
		
		ОтветHTTP = Соединение1.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();	
		
		Если ОтветHTTP.КодСостояния <> 200 Тогда
        ТелоОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
        ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(ТелоОтвета);
    	КонецЕсли;   
	
		Ответ = ОписаниеОшибки();	
	
		
	Возврат Ответ; 	
	
КонецФункции