
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	//TODO: Вставить содержимое обработчика
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ОтображениеЭлементовФормы()
	Иначе
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		ОтображениеЭлементовФормы()
		
	КонецЕсли;
	
	
КонецПроцедуры


Процедура ОтображениеЭлементовФормы()
	
	Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
	
	
КонецПроцедуры 





