


Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	
	Движения.ВКМ_ДополнительныеНачисления.Очистить();
	Движения.ВКМ_Удержания.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	// 2. Формирование движений по начислениям и удержаниям
    Для Каждого СтрокаТЧ Из СписокСотрудников Цикл
        
        // Запись премии
        ДвижениеНачисление = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        ДвижениеНачисление.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
        ДвижениеНачисление.Сотрудник = СтрокаТЧ.Сотрудник;
        ДвижениеНачисление.ПериодРегистрации = ПериодРегистрации;
        ДвижениеНачисление.Результат = СтрокаТЧ.СуммаПремии;
        
        // Запись НДФЛ
        ДвижениеУдержание = Движения.ВКМ_Удержания.Добавить();
        ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        ДвижениеУдержание.Сотрудник = СтрокаТЧ.Сотрудник;
        ДвижениеУдержание.ПериодРегистрации = ПериодРегистрации;
        ДвижениеУдержание.Результат = СтрокаТЧ.СуммаПремии * 0.13;
        
        // 3. Формирование взаиморасчетов 
        ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
        ДвижениеВзаиморасчеты.Период      = Дата;
        ДвижениеВзаиморасчеты.Сотрудник   = СтрокаТЧ.Сотрудник;
        ДвижениеВзаиморасчеты.Сумма       = СтрокаТЧ.СуммаПремии * 0.87; 
        
    КонецЦикла;
    
    Движения.Записать();
	
КонецПроцедуры