
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	Для Каждого СтрокаТЧ Из Выплаты Цикл
		
		
		Если СтрокаТЧ.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период      = Дата;
		Движение.Сотрудник   = СтрокаТЧ.Сотрудник;
		Движение.Сумма       = СтрокаТЧ.Сумма;
		
	КонецЦикла;


КонецПроцедуры

